{
  "teststorydesc" : "At 5:41 PM, the patient dies. The working diagnoses (ICD-10CM S02.10XA and S06.9X6A) are resolved/inactivated, and the final diagnosis is concussion with loss of consciousness of unspecified duration, initial encounter, ICD-10CM S06.0X9A. Western Regional Medical Center reports syndromic surveillance data to the state health department (SHD). At 6:00 PM on July 17, 2012 the hospital's electronic health record module for syndromic surveillance data assembles and transmits an ADT 03 Discharge message about this encounter to SHD.",
  "comments" : "This Test Case provides an example of an ED visit where the patient's demographic information is unavailable at registration, admit/encounter reason is captured as a coded value using an ICD-10 CM code, two working diagnoses and a final diagnosis are captured using ICD-10 CM codes, and the patient dies. The dates and times in this test case illustrate the sequence of clinical and messaging events. Since the exact dates and times are not reproducible when modeling the test case with a Health IT Module, only date and time format will be validated within tester submitted test data. ICD-10 CM diagnosis codes are acceptable with or without decimals.",
  "preCondition" : "A08-Update message is sent before the A03-Discharge message.",
  "postCondition" : "No PostCondition",
  "testObjectives" : "This test case examines a Health IT Module's ability to create ADT A03-Discharge message within PHIN Messaging Guide's conformance requirements for emergency department (ED) data.",
  "evaluationCriteria" : "No evaluation criteria",
  "notes" : "This Test Step does not prescribe the method used by the Health IT Module to change a Working diagnosis to a Final diagnosis. The Test Step only validates a specific ADT message type. An ICD-10 CM code is used for coding the final diagnosis. The Tester may ignore errors generated by the Test Tool related to incorrect code when the ICD-10 CM code used in the message is determined to be a valid code."
}