{
  "teststorydesc" : "A mother brings her 6-month old male infant to Big City Children`s Urgent Care on February 20, 2010 at 8:30 AM. A clerical assistant registers the patient. She records the patient`s name, date of birth, race, ethnicity, residence, insurance information, and health history. The clerical assistant also records the patient's chief complaint in free-text is, \"Fever, cough, and earache.\" At 8:35 AM a nurse sees the patient and performs a vital sign assessment, noting that the child currently has a temperature of 101.2 with a productive cough and right ear inflammation and fluid build-up. At 9:00 AM the physician orders a rapid influenza test, chest x-ray, and a treatment. The physician assigns the patient with working diagnoses of influenza with other respiratory manifestations (ICD-9 CM diagnosis code of 487.1), and stenosis of external ear canal due to inflammation (ICD-9 CM diagnosis code of 380.53) within the patient`s electronic medical record. Big City Children's Urgent Care is an outpatient facility operated by Children's Hospital of Big City that routinely sends electronic syndromic surveillance data to the Big City Health Department (BCHD) in accordance with a city regulation. At 10:00 AM on February 20, 2010, the facility`s electronic health record module for syndromic surveillance data assembles and transmits a Registration ADT message about this patient encounter.",
  "comments" : "This Test Scenario provides an example of clinical encounter that could take place in either an urgent care or emergency clinical setting. It is therefore applicable to EHR technology used in some ambulatory settings. Dates and times are provided in this test scenario to illustrate the sequence of clinical and messaging events. Since the exact dates and times are not reproducible when modeling the test scenario with EHR technology, only date and time format will be validated within tester submitted test data.",
  "preCondition" : "No PreCondition\r\n",
  "postCondition" : "No PostCondition\r\n",
  "testObjectives" : "This test step examines a Health IT Module's ability to create ADT^A04 Registration message within PHIN Messaging Guide's conformance requirements.",
  "evaluationCriteria" : "Message Validation Report",
  "notes" : "Per ONC, for certification testing HIT developers must demonstrate that their system supports either the ICD-10 CM or SNOMED CT value set and are no longer required to demonstrate support for the ICD-9 CM value set (this policy is not conformant to the PHIN Syndromic Surveillance Messaging Guide, Rel2.0, April 2015).  <div><br></div><div>ICD-9 CM codes still are provided in the test data for coding the working diagnoses.The HIT developer must supply equivalent ICD-10CM or SNOMED CT code data in the test message. If the HIT developer uses ICD-10 CM or SNOMED CT codes that are equivalent to the ICD-9CM codes provided, the Tester may ignore errors generated by the Test Tool related to incorrect code/name of coding system and must determine via visual inspection whether the ICD-10 CM or SNOMED CT code data are valid. </div><div><br></div><div>ICD-10 CM diagnosis codes are acceptable with or without decimals. </div><div><br></div><div>Although the other units of measure for patient age are acceptable in general (and the Context-free validation accepts any of the valid units of measure for age), this Scenario specifies that \"mo\" for months be used in this message for the Context-based validation. <div><br></div><div>Visit Number ID (PV1-19.1) must be populated with the same value for all messages included in this Test Case to reflect the requirement in real-world installations. Test Tool does not automatically test for this requirement, so Testers must manually inspect the messages to verify that PV1-19.1 is the same for all Test Step messages for a given Test Case. </div></div>"
}