{
  "teststorydesc" : "An unconscious white female with critical injuries to her head and neck is brought by ambulance to Western Regional Medical Center's Emergency Department at 5:00 PM on July 17, 2012. The paramedics report that the patient turned her bicycle in to a bus moving at 35 mph. The collision threw the cyclist, who was not wearing a helmet, head first to the ground. The patient's vital signs are stable, but she is on ventilation. Unable to find any identification, the patient is registered without her true name, date of birth, race, ethnicity, insurance information, and health history. Her admit/encounter reason is logged as V31.4XXA (Pedal cycle driver injured in collision with car, pick-up truck or van in traffic accident, initial encounter). No working diagnoses are assigned. Western Regional Medical Center reports syndromic surveillance data to the state health department (SHD). At 5:00 PM on July 17, 2012 the hospital's electronic health record module for syndromic surveillance data assembles and transmits an ADT^A04 Registration message about this encounter to SHD.",
  "comments" : "This Test Case provides an example of an ED visit where the patient's demographic information is unavailable at registration, admit/encounter reason is captured as a coded value using an ICD-10 CM code, two working diagnoses and a final diagnosis are captured using ICD-10 CM codes, and the patient dies. The dates and times in this test case illustrate the sequence of clinical and messaging events. Since the exact dates and times are not reproducible when modeling the test case with a Health IT Module, only date and time format will be validated within tester submitted test data.",
  "preCondition" : "No PreCondition",
  "postCondition" : "No PostCondition",
  "testObjectives" : "This test step examines a Health IT Module's ability to create ADT^A04 Registration message within PHIN Syndromic Surveillance Messaging Guide's conformance requirements.",
  "evaluationCriteria" : "Message Validation Report",
  "notes" : "Per ONC, for certification testing HIT developers must demonstrate that their system supports either the ICD-10 CM or SNOMED CT value set and are no longer required to demonstrate support for the ICD-9 CM value set (this policy is not conformant to the PHIN Syndromic Surveillance Messaging Guide, Rel2.0, April 2015).  <div><br></div><div>An ICD-10 CM code is provided in the test data for coding the admit/encounter reason. If the HIT developer uses a different but equivalent ICD-10 CM code than the one provided or uses an equivalent SNOMED CT code, the Tester may ignore errors generated by the Test Tool related to incorrect code/name of coding system when the ICD-10 CM or SNOMED CT code data used in the message are determined via visual inspection to be valid data. </div><div><br></div><div>ICD-10 CM codes are acceptable with or without decimals. </div><div><br></div><div>Visit Number ID (PV1-19.1) must be populated with the same value for all messages included in this Test Case to reflect the requirement in real-world installations. Test Tool does not automatically test for this requirement, so Testers must manually inspect the messages to verify that PV1-19.1 is the same for all Test Step messages for a given Test Case. </div>"
}