{
  "teststorydesc" : "<p><span style=\"font-family: Arial; font-size: small;\">At 8:00 AM the attending physician determines, with lab\r\nresults indicating that the patient is suffering from severe metabolic\r\nacidosis, that the patient has carbon monoxide poisoning. She orders a hospital\r\nadmission for the patient to receive hyperbaric oxygen therapy (HBOT),\r\novernight observation, and a full neurological assessment. At 8:10 AM, the\r\nphysician updates the patient's record with a working diagnosis, coded with the\r\nSNOMED CT code 17383000 (Toxic effect of carbon monoxide (disorder)), and orders\r\nadmission for carbon monoxide poisoning.  Southern Midwest Medical Center reports\r\nsyndromic surveillance data to the city health department (CHD). At 8:15 AM on\r\nFebruary 1, 2010, the hospital's electronic health record module for syndromic\r\nsurveillance data assembles and transmits an Update message about this\r\nencounter to SHD.</span></p><p class=\"MsoNormal\" style=\"font-family: Arial, Verdana; font-size: 10pt; font-style: normal; font-variant: normal; font-weight: normal; line-height: normal;\"><o:p></o:p></p>\r\n",
  "comments" : "<p>This Test Case provides an example of an ED visit for which the patient's chief complaint is captured as free-text, working diagnosis and final diagnosis are captured with SNOMED CT codes, the patient is discharged from the ED and admitted for inpatient care, and the Admit/Encounter Reason is captured with a SNOMED CT code. Dates and times are provided in this test case to illustrate the sequence of clinical and messaging events. Since the exact dates and times are not reproducible when modeling the Test Case with a Health IT Module, only date and time format will be validated within tester submitted test data.</p>\r\n",
  "preCondition" : "<p>A04-Registration message is sent before A08-Update message.</p>\r\n",
  "postCondition" : "<p>No PostCondition</p>",
  "testObjectives" : "<p>This test case examines a Health IT Module's ability to create ADT A08-Update message, within the parameters of the PHIN Messaging Guide's conformance requirements.</p>\r\n",
  "evaluationCriteria" : "<p>No evaluation criteria</p>\r\n",
  "notes" : "<p>No Note</p>"
}