{
  "teststorydesc" : "A disoriented 70 year-old male is brought by his neighbor to Southern Midwest Medical Center's Emergency Department at 7:30 AM on February 1, 2010, the day following a blizzard that caused power outages in many city neighborhoods. The patient is complaining of \"a headache, nausea, and dizziness\". The neighbor explains that he was concerned about the patient since the building's electric heating system was not working. At 7:00 AM, he entered the patient's apartment and found the patient unconscious in the kitchen next to a fully lit gas oven and stove running at high. A clerical assistant registers the patient with the neighbor's help. She records the patient's name, date of birth, race, ethnicity, residence, insurance information, and health history. The clerical assistant also enters the patient's chief complaint as, \"A headache, nausea, and dizziness\". Southern Midwest Medical Center reports syndromic surveillance data to the state health department (SHD). At 7:45 AM on February 1, 2010, the hospital's electronic health record module for syndromic surveillance data assembles and transmits a Registration message about this encounter to SHD.",
  "comments" : "This Test Case provides an example of an ED visit for which the patient's chief complaint is captured as free-text, working diagnosis and final diagnosis are captured with SNOMED CT codes, the patient is discharged from the ED and admitted for inpatient care, and the Admit/Encounter Reason is captured with a SNOMED CT code. Dates and times are provided in this test case to illustrate the sequence of clinical and messaging events. Since the exact dates and times are not reproducible when modeling the Test Case with a Health IT Module, only date and time format will be validated within tester submitted test data.",
  "preCondition" : "No PreCondition",
  "postCondition" : "No PostCondition",
  "testObjectives" : "This test step examines a Health IT Module's ability to create ADT A04-Registration message within the PHIN Messaging Guide's conformance requirements for syndromic surveillance.",
  "evaluationCriteria" : "Message Validation Report ",
  "notes" : "Visit Number ID (PV1-19.1) for the ADT^A04, ADT^A08, and ADT^A03 messages in this Test Case must be populated with the same value to reflect the requirement in real-world installations. The Test Tool does not automatically test for this requirement, so Testers must manually inspect the messages to verify that the PV1-19.1 value is the same for the first three Test Step messages for this Test Case."
}