{
  "teststorydesc" : "<p class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\">Syndromic surveillance is public health surveillance that emphasizes\r\nthe use of near ?real-time? health data and statistical tools for disease or\r\nhazardous event detection, situation awareness for mass gatherings and public\r\nhealth emergencies, and ad hoc and population health trend analyses. For\r\nsyndromic surveillance purposes, required data on all clinical encounters must\r\nbe sent to the jurisdictional public health agency within 24 hours of the any\r\ngiven encounter, and in accordance with local or state laws and practices.<o:p></o:p></p><p class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"><o:p>&nbsp;</o:p></p><p class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\">The IP Visit-Cardiac Surgery Test Case provides an example of an\r\ninpatient surgical visit for a patient with multiple diagnoses. In this\r\nscenario, syndromic surveillance data are sent to a state public health agency\r\nin accordance with guidelines recommended by the International Society for\r\nDisease Surveillance (i.e., once following admission and once following discharge).<o:p></o:p></p><p class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"><o:p>&nbsp;</o:p></p><p class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\">In this test case, a middle aged man is admitted for a pre-scheduled\r\nsurgical removal of a coronary artery obstruction and insertion of stents,\r\nspends one night in the hospital for observation, and is discharged home.<o:p></o:p></p><p class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\">&nbsp;<o:p></o:p></p><p class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\">\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n</p><p class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\">This test case involves 2 steps: an admission message (ADTA01); and a\r\ndischarge message (ADTA03).<o:p></o:p></p>",
  "comments" : "No Comments",
  "preCondition" : "No PreCondition",
  "postCondition" : "No PostCondition",
  "testObjectives" : "No Test Objectives",
  "evaluationCriteria" : "No evaluation criteria",
  "notes" : "No Note"
}