{
  "teststorydesc" : "<p>An unconscious white female with critical injuries to her head and neck is brought by ambulance to Western Regional Medical Center's Emergency Department at 5:00 PM on July 17, 2012. The paramedics report that the patient turned her bicycle in to a bus moving at 35 mph. The collision threw the cyclist, who was not wearing a helmet, head first to the ground. The patient's vital signs are stable, but she is on ventilation. Unable to find any identification, the patient is registered without her true name, date of birth, race, ethnicity, insurance information, and health history. Her admit/encounter reason is logged as V13.9XXA. No working diagnoses are assigned. Western Regional Medical Center reports syndromic surveillance data to the state health department (SHD). At 5:00 PM on July 17, 2012 the hospital's electronic health record module for syndromic surveillance data assembles and transmits an ADT 04 Registration message about this encounter to SHD.</p>",
  "comments" : "<p>This Test Case provides an example of an ED visit where the patient's demographic information is unavailable at registration, admit/encounter reason is captured as a coded value using an ICD-10 CM code, two working diagnoses and a final diagnosis are captured using ICD-10 CM codes, and the patient dies. The dates and times in this test case illustrate the sequence of clinical and messaging events. Since the exact dates and times are not reproducible when modeling the test case with a Health IT Module, only date and time format will be validated within tester submitted test data. ICD-10 CM diagnosis codes are acceptable with or without decimals.</p>\r\n",
  "preCondition" : "<p>No PreCondition</p>\r\n",
  "postCondition" : "<p>No PostCondition</p>",
  "testObjectives" : "<p>This test step examines a Health IT Module's ability to create ADT A04-Registration message within PHIN Syndromic Surveillance Messaging Guide's conformance requirements.</p>\r\n",
  "evaluationCriteria" : "<p>No evaluation criteria</p>",
  "notes" : "<p><p>An ICD-10CM code is used for coding the admit/encounter reason. The Tester may ignore errors generated by the Test Tool related to incorrect code when the ICD-10 code used in the message is determined to be a valid code.</p></p>\r\n"
}