{
  "teststorydesc" : "<div><p class=\"MsoNormal\"><span style=\"font-size: 10pt; font-family: Arial, sans-serif;\">On August 17, 2015 at\r\n7:00 AM, a 51-year old male arrives at Mountainview General Hospital for a\r\npre-scheduled surgical removal of a coronary artery obstruction and insertion\r\nof stents. A clerical assistant registers the patient for admission. He records\r\nthe patient's name, date of birth, race, ethnicity, residence, and insurance\r\ninformation. At 7:30 AM the patient is escorted to a pre-operation room where a\r\nnurse captures the patient's health history, which includes chest pain, inputs\r\nthe reason for visit as </span><span style=\"font-size:10.0pt;font-family:\"Arial\",\"sans-serif\"\">I25.110\r\n(Atherosclerotic heart disease of native coronary artery with unstable angina\r\npectoris),</span><span style=\"font-size: 10pt; font-family: Arial, sans-serif;\"> and inputs </span><span style=\"font-size:10.0pt;font-family:\"Arial\",\"sans-serif\"\">angina pectoris for\r\nthe patient's diagnosis (I20.9). </span><span style=\"font-size: 10pt; font-family: Arial, sans-serif;\"> The patient is then\r\nprepared for the procedure, and at 8:30 AM the patient has the procedure. It\r\noccurs without incident, and the patient goes to post-operation recovery unit\r\nto wake from anesthesia, and receive a post-op examination. At 2:00 PM the\r\npatient, who is in good condition, is transported to a cardiac unit for\r\novernight observation.<o:p></o:p></span></p></div><div><p class=\"MsoNormal\">Mountainview General Hospital reports inpatient\r\nsyndromic surveillance data to the state health department (SHD) for all new\r\npatient admissions once per day. At 1:00 AM on August 18, 2015, the hospital's electronic health record module for syndromic surveillance data assembles and\r\ntransmits an ADT 01 Admission message about this encounter to SHD.<o:p></o:p></p></div>",
  "comments" : "This Test Case provides an example of an inpatient visit where syndromic surveillance data are sent to a public health agency in accordance with <a href=\"http://www.syndromic.org/storage/documents/meaningfuluse/ISDS_2012-MUse-Recommendations.pdf\" target=\"_blank\">guidelines recommended by the International Society for Disease Surveillance</a>. The dates and times in this test case illustrate the sequence of clinical and messaging events. Since the exact dates and times are not reproducible when modeling the test case with EHR technology, only date and time format will be validated within tester submitted test data. ICD-10 diagnosis codes are acceptable with or without decimals.",
  "preCondition" : "No PreCondition",
  "postCondition" : "No PostCondition",
  "testObjectives" : "This test case examines a Health IT Module's ability to create ADT A01-Admission message within PHIN Syndromic Surveillance Messaging Guide's conformance requirements.",
  "evaluationCriteria" : "No evaluation criteria",
  "notes" : "An ICD-10 CM code is used for coding the working diagnosis. The Tester may ignore errors generated by the Test Tool related to incorrect code when the ICD-10 code used in the message is determined to be a valid code."
}