{
  "teststorydesc" : "<div><span style=\"font-family: Arial, sans-serif; font-size: 10pt;\">On August 17, 2015 at 7:00 AM, a 51-year old male arrives at\r\nMountainview General Hospital for a pre-scheduled surgical removal of a\r\ncoronary artery obstruction and insertion of stents. A clerical assistant\r\nregisters the patient for admission. He records the patient's name, date of\r\nbirth, race, ethnicity, residence, and insurance information. At 7:30 AM the\r\npatient is escorted to a pre-operation room where a nurse captures the\r\npatient's health history, which includes chest pain, inputs the reason for\r\nvisit as z95.5, and inputs multiple diagnoses for the patient (Primary I25.9,\r\nsecondary I20.9, and tertiary R07.9). The patient is then prepared for the\r\nprocedure, and at 8:30 AM the patient has the procedure. It occurs without\r\nincident, and the patient goes to post-operation recovery unit to wake from\r\nanesthesia, and receive a post-op examination. At 2:00 PM the patient, who is\r\nin good condition, is transported to a cardiac unit for overnight observation.</span><span class=\"apple-converted-space\" style=\"font-family: Arial, sans-serif; font-size: 10pt;\"> </span></div><div><p class=\"MsoNormal\">\r\n<br>\r\nMountainview General Hospital reports inpatient\r\nsyndromic surveillance data to the state health department (SHD) for all new\r\npatient admissions once per day. At 1:00 AM on August 18, 2015, the hospital's electronic health record module for syndromic surveillance data assembles and\r\ntransmits an ADT 01 Admission message about this encounter to SHD.<o:p></o:p></p></div>",
  "comments" : "This Test Case provides an example of an inpatient visit where syndromic surveillance data are sent to a public health agency in accordance with <a href=\"http://www.syndromic.org/storage/documents/meaningfuluse/ISDS_2012-MUse-Recommendations.pdf\" target=\"_blank\">guidelines recommended by the International Society for Disease Surveillance</a>. The dates and times in this test case illustrate the sequence of clinical and messaging events. Since the exact dates and times are not reproducible when modeling the test case with EHR technology, only date and time format will be validated within tester submitted test data. ICD-10 diagnosis codes are acceptable with or without decimals.",
  "preCondition" : "No PreCondition",
  "postCondition" : "No PostCondition",
  "testObjectives" : "This test case examines a Health IT Module's ability to create ADT A01-Admission message within PHIN Syndromic Surveillance Messaging Guide's conformance requirements.",
  "evaluationCriteria" : "No evaluation criteria",
  "notes" : "An ICD-10 CM code is used for coding the working diagnosis. The Tester may ignore errors generated by the Test Tool related to incorrect code when the ICD-10 code used in the message is determined to be a valid code."
}