{
  "teststorydesc" : "<p>On August 17, 2015 at 7:00 AM, a 51-year old male arrives at Our Lady of Perpetual Misery Hospital for a pre-scheduled surgical removal of a coronary artery obstruction and insertion of stents. A clerical assistant registers the patient for admission. He records the patient?s name, date of birth, race, ethnicity, residence, and insurance information. At 7:30 AM the patient is escorted to a pre-operation room where a nurse captures the patient?s health history which includes chest pain, inputs the reason for visit as z95.5, and the patient and inputs multiple diagnoses for the patient (Primary I25.0, secondary I20.9, and tertiary R07.4). The patient is then prepared surgery, and at 8:30 AM the patient has the surgery. It occurs without incident, and the patient goes to post-operation recovery unit to wake from anesthesia, and receive a post-op examination. At 2:00 PM the patient, who is in good condition, is transported to a cardiac unit for overnight observation.</p>\r\n\r\n<p>Our Lady of Perpetual Healing Hospital reports inpatient syndromic surveillance data to the state health department (SHD) for all new patient admissions once per day. At 1:00 AM on August 18, 2015, the hospital's electronic health record module for syndromic surveillance data assembles and transmits an ADT 01 Admission message about this encounter to SHD.</p>\r\n",
  "comments" : "<p>This Test Case provides an example of an inpatient visit where syndromic surveillance data are sent to a public health agency in accordance with guidelines recommended by the International Society for Disease Surveillance. The dates and times in this test case illustrate the sequence of clinical and messaging events. Since the exact dates and times are not reproducible when modeling the test case with EHR technology, only date and time format will be validated within tester submitted test data. ICD-10 diagnosis codes are acceptable with or without decimals</p>\r\n",
  "preCondition" : "No PreCondition",
  "postCondition" : "No PostCondition",
  "testObjectives" : "<p>This test case examines a Health IT Module&#39;s ability to create ADT A01-Admission message within PHIN Syndromic Surveillance Messaging Guide&#39;s conformance requirements.</p>\r\n",
  "evaluationCriteria" : "<p>No evaluation criteria</p>\r\n",
  "notes" : "<div>\r\n<p>An ICD-10 CM code is used for coding the working diagnosis. The Tester may ignore errors generated by the Test Tool related to incorrect code when the ICD-10 code used in the message is determined to be a valid code.</p>\r\n</div>\r\n"
}