{
  "teststorydesc" : "<p>On August 17, 2015 at 7:00 AM, a 51-year old male arrives at\r\nMountainview General Hospital for a pre-scheduled surgical removal of a\r\ncoronary artery obstruction and insertion of stents. A clerical assistant\r\nregisters the patient for admission. He records the patient's name, date of\r\nbirth, race, ethnicity, residence, and insurance information. At 7:30 AM the\r\npatient is escorted to a pre-operation room where a nurse captures the\r\npatient's health history, which includes chest pain, inputs the reason for\r\nvisit as I25.110 (Atherosclerotic heart disease of native coronary artery with unstable angina pectoris), and inputs angina pectoris for the\r\npatient's diagnosis (I20.9).The\r\npatient is then prepared for the procedure, and at 8:30 AM the patient has the\r\nprocedure. It occurs without incident, and the patient goes to post-operation\r\nrecovery unit to wake from anesthesia, and receive a post-op examination. At\r\n2:00 PM the patient, who is in good condition, is transported to a cardiac unit\r\nfor overnight observation.Mountainview General Hospital reports inpatient syndromic\r\nsurveillance data to the state health department (SHD) for all new patient\r\nadmissions once per day. At 1:00 AM on August 18, 2015, the hospital's\r\nelectronic health record module for syndromic surveillance data assembles and\r\ntransmits an ADT^A01 Admission message about this encounter to SHD.</p>",
  "comments" : "This Test Case provides an example of an inpatient visit where syndromic surveillance data are sent to a public health agency in accordance with <a href=\"http://www.syndromic.org/storage/documents/meaningfuluse/ISDS_2012-MUse-Recommendations.pdf\" target=\"_blank\">guidelines recommended by the International Society for Disease Surveillance</a>. The dates and times in this test case illustrate the sequence of clinical and messaging events. Since the exact dates and times are not reproducible when modeling the test case with EHR technology, only date and time format will be validated within tester submitted test data.",
  "preCondition" : "No PreCondition",
  "postCondition" : "No PostCondition",
  "testObjectives" : "This test step examines a Health IT Module's ability to create ADT^A01 Admission message within PHIN Syndromic Surveillance Messaging Guide's conformance requirements.",
  "evaluationCriteria" : "Message Validation Report ",
  "notes" : "Per ONC, for certification testing HIT developers must demonstrate that their system supports either the ICD-10 CM or SNOMED CT value set and are no longer required to demonstrate support for the ICD-9 CM value set (this policy is not conformant to the PHIN Syndromic Surveillance Messaging Guide, Rel2.0, April 2015). <div><br></div><div>ICD-10 CM codes are provided in the test data for coding the admit/encounter reason and working diagnosis. If the HIT developer uses different but equivalent ICD-10 CM codes than the ones provided or equivalent SNOMED CT codes, the Tester may ignore errors generated by the Test Tool related to incorrect code/name of coding system when the ICD-10 CM or SNOMED CT code data used in the message are determined via visual inspection to be valid data. <div><br></div><div>The ICD-10 CM codes are acceptable with or without decimals. <div><br></div><div>Visit Number ID (PV1-19.1) must be populated with the same value for all messages included in this Test Case to reflect the requirement in real-world installations. Test Tool does not automatically test for this requirement, so Testers must manually inspect the messages to verify that PV1-19.1 is the same for all Test Step messages for a given Test Case. </div></div></div>"
}