{
  "teststorydesc" : "At 8:00 AM the attending physician determines, with lab results indicating that the patient is suffering from severe metabolic acidosis, that the patient has carbon monoxide poisoning. She orders a hospital admission for the patient to receive hyperbaric oxygen therapy (HBOT), overnight observation, and a full neurological assessment. At 8:10 AM, the physician updates the patient's record with a working diagnosis, coded with the SNOMED CT code 242383002 (accidental exposure to carbon monoxide), and orders admission for carbon monoxide poisoning. Southern Midwest Medical Center reports syndromic surveillance data to the city health department (CHD). At 8:15 AM on February 1, 2010, the hospital's electronic health record module for syndromic surveillance data assembles and transmits an Update message about this encounter to SHD.",
  "comments" : "This Test Case provides an example of an ED visit for which the patient's chief complaint is captured as free-text, working diagnosis and final diagnosis are captured with SNOMED CT codes, the patient is discharged from the ED and admitted for inpatient care, and the Admit/Encounter Reason is captured with a SNOMED CT code. Dates and times are provided in this test case to illustrate the sequence of clinical and messaging events. Since the exact dates and times are not reproducible when modeling the Test Case with a Health IT Module, only date and time format will be validated within tester submitted test data.",
  "preCondition" : "A04-Registration message is sent before A08-Update message.",
  "postCondition" : "No PostCondition ",
  "testObjectives" : "This test step examines a Health IT Module's ability to create ADT^A08 Update message, within the parameters of the PHIN Messaging Guide's conformance requirements.",
  "evaluationCriteria" : "Message Validation Report ",
  "notes" : "Per ONC, for certification testing HIT developers must demonstrate that their system supports either the ICD-10 CM or SNOMED CT value set and are no longer required to demonstrate support for the ICD-9 CM value set (this policy is not conformant to the PHIN Syndromic Surveillance Messaging Guide, Rel2.0, April 2015).  <div><br></div><div>A SNOMED CT code is provided in the test data for coding the working diagnosis. The Tool is designed to accept the following SNOMED CT codes without generating an error related to the working diagnosis<span style=\"font-size: 10pt;\">: </span></div><div><span style=\"font-size: 10pt;\">?\t242383002 - Accidental exposure to carbon monoxide (used in Test Story)</span></div><div>?\t420057003 - Accidental poisoning by carbon monoxide </div><div>  ?\t95875007 - Exposure to carbon monoxide (event) </div><div><br></div><div>If the HIT developer uses a different but equivalent SNOMED CT code than the ones provided/accepted or an equivalent ICD-10 CM code, the Tester may ignore errors generated by the Test Tool related to incorrect code/name of coding system when the SNOMED CT or ICD-10 CM code data used in the message are determined via visual inspection to be valid data.  <div><br></div><div>The ICD-10 CM diagnosis code is acceptable with or without decimals. <div><br></div><div>Visit Number ID (PV1-19.1) for the ADT^A04, ADT^A08, and ADT^A03 messages in this Test Case must be populated with the same value to reflect the requirement in real-world installations. The Test Tool does not automatically test for this requirement, so Testers must manually inspect the messages to verify that the PV1-19.1 value is the same for the first three Test Step messages for this Test Case. </div></div></div>"
}