{
  "teststorydesc" : "The patient is quickly discharged from the emergency department (ED) and transported within the facility to a hyperbaric chamber for HBOT. At 8:25 AM, ED staff complete the patient record and administratively discharge the patient from the ED. The working diagnosis is updated to final diagnosis. The patient's final diagnosis is, \"Accidental exposure to carbon monoxide,\" (SNOMED CT code 242383002). Southern Midwest Medical Center reports syndromic surveillance data to the city health department (CHD). At 8:30 AM on February 1, 2010, the hospital's electronic health record module for syndromic surveillance data assembles and transmits a Discharge message about this encounter to SHD.",
  "comments" : "This Test Case provides an example of an ED visit for which the patient's chief complaint is captured as free-text, working diagnosis and final diagnosis are captured with SNOMED CT codes, the patient is discharged from the ED and admitted for inpatient care, and the Admit/Encounter Reason is captured with a SNOMED CT code. Dates and times are provided in this test case to illustrate the sequence of clinical and messaging events. Since the exact dates and times are not reproducible when modeling the Test Case with a Health IT Module, only date and time format will be validated within tester submitted test data.",
  "preCondition" : "A08-Update message is sent before A03-Discharge message.",
  "postCondition" : "No PostCondition",
  "testObjectives" : "This test case examines an Health IT Module's ability to create ADT^A03 Discharge message within the PHIN Messaging Guide's conformance requirements.",
  "evaluationCriteria" : "No evaluation criteria",
  "notes" : "HIT developers must demonstrate that their system supports ICD-9CM, ICD-10CM, and SNOMED CT value sets in order to be conformant to the PHIN Syndromic Surveillance Messaging Guide, Rel2.0, April 2015. If an HIT developer identifies Emergency Department as the only health care setting applicable to their system, the Tester must execute the certification testing for this Test Step by having the system create messages (1) using the SNOMED CT codes provided in the test data for DG1-3 in a test message, (2) using clinically appropriate (equivalent to the SNOMED CT codes provided in the test data) and valid ICD-9CM codes provided by the vendor for DG1-3 in a test message, and (3) using clinically appropriate (equivalent to the SNOMED CT codes provided in the test data) and valid ICD-10CM codes provided by the vendor for DG1-3 in a test message. The Tester must perform visual inspection of the test messages created by the system in order to determine whether DG1-3 fields are populated with appropriate and valid ICD-9CM and ICD-10CM codes. The Tester must perform visual inspection of the test messages created by the system in order to determine whether DG1-3 fields are populated with appropriate and valid ICD-9CM and ICD-10CM codes. <div><br></div><div>A SNOMED CT code is used for coding the final diagnosis. The Tool is designed to accept the following SNOMED CT codes without generating an error related to the final diagnosis: <div>242383002 - Accidental exposure to carbon monoxide (used in Test Story) <div>420057003 - Accidental poisoning by carbon monoxide</div><div>95875007 - Exposure to carbon monoxide (event)<div><div><br></div><div>Any one of these codes may be used to populate DG1-3.1 in the test message without triggering an error notification in the Tool. If the vendor uses a different but equivalent SNOMED CT code than the ones listed, the Tester may ignore errors generated by the Test Tool related to incorrect code when the SNOMED CT code used in the message is determined to be a valid code.  ICD-9CM and ICD-10CM diagnosis codes are acceptable with or without decimals. <div><br></div><div>This test case does not prescribe the method used by the Health IT Module to change a working diagnosis to a final diagnosis. The test case only validates a specific ADT message type. <div><br></div><div>Visit Number ID (PV1-19.1) for the ADT^A04, ADT^A08, and ADT^A03 messages in this Test Case must be populated with the same value to reflect the requirement in real-world installations. The Test Tool does not automatically test for this requirement, so Testers must manually inspect the messages to verify that the PV1-19.1 value is the same for the first three Test Step messages for this Test Case.</div></div></div></div></div></div></div>"
}