{
  "teststorydesc" : "<h4 style=\"margin: 0in 0in 0.0001pt;\"><span style=\"font-size: 10pt; font-weight: normal;\" arial\",\"sans-serif\";font-weight:normal\"=\"\">At 9:00 the next day,\r\nAugust 18, 2015, the patient is visited by the surgeon and an attending\r\nphysician who perform a physical to check for signs and symptoms of any\r\npost-operation compilations. The patient reports that he is not experiencing\r\nany chest pain. The physicians both observe that the patient with signs of\r\ncardiac arrhythmia, but conclude that he is otherwise in good condition. They\r\nclear the patient for discharge. At 12:00 PM the patient goes home.<u1:p></u1:p><o:p></o:p></span></h4><h4>\r\n\r\n</h4><h4 style=\"margin: 0in 0in 0.0001pt;\"><span style=\"font-size: 10pt; font-weight: normal;\" arial\",\"sans-serif\";font-weight:normal\"=\"\">Our Lady of Perpetual\r\nMisery Hospital reports inpatient syndromic surveillance data to the state\r\nhealth department (SHD) for all new patient discharges once per day. At 1:00 AM\r\non August 19, 2015, the hospital's electronic health record module for\r\nsyndromic surveillance data assembles and transmits an ADT 04 Discharge message\r\nabout this encounter to SHD.</span><span style=\"font-weight: normal; font-size: 10pt; font-family: Arial, sans-serif;\"><o:p></o:p></span></h4>",
  "comments" : "<p class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"><span style=\"font-size: 10pt; font-family: Arial, sans-serif;\">This Test Case provides an example of an\r\ninpatient visit where syndromic surveillance data are sent to a public health\r\nagency in accordance with<span class=\"apple-converted-space\">&nbsp;</span></span><span style=\"font-size:10.0pt;mso-bidi-font-size:11.0pt;font-family:&quot;Arial&quot;,&quot;sans-serif&quot;\"><a href=\"http://www.syndromic.org/storage/documents/meaningfuluse/ISDS_2012-MUse-Recommendations.pdf\">guidelines recommended by the International Society for\r\nDisease Surveillance</a>. The dates and times in this test case illustrate the\r\nsequence of clinical and messaging events. Since the exact dates and times are\r\nnot reproducible when modeling the test case with EHR technology, only date and\r\ntime format will be validated within tester submitted test data. ICD-10\r\ndiagnosis codes are acceptable with or without decimals.<o:p></o:p></span></p>",
  "preCondition" : "<p class=\"MsoNormal\">A01-Admission message is sent before A03-Discharge message.<o:p></o:p></p>",
  "postCondition" : "No PostCondition",
  "testObjectives" : "<p class=\"MsoNormal\">This test case examines a Health IT Module's ability to\r\ncreate ADT A04-Discharge message within PHIN Messaging Guide's conformance\r\nrequirements.<o:p></o:p></p>",
  "evaluationCriteria" : "No evaluation criteria",
  "notes" : "<p class=\"MsoNormal\">An ICD-10 CM code is used for coding the working diagnosis.\r\nThe Tester may ignore errors generated by the Test Tool related to incorrect\r\ncode when the ICD-10 code used in the message is determined to be a valid code.<o:p></o:p></p>"
}