{
  "teststorydesc" : "At 5:41 PM, the patient dies. The working diagnoses (ICD-10-CM S02.112A and S06.9X3A) are resolved/inactivated, and the final diagnoses are  S06.0X8A (Concussion with LOC of any duration with death due to other cause prior to regaining consciousness) and S02.112A (Type III occipital condyle fracture, initial encounter for closed fracture). Western Regional Medical Center reports syndromic surveillance data to the state health department (SHD). At 6:00 PM on July 17, 2012 the hospital's electronic health record module for syndromic surveillance data assembles and transmits an ADT^A03 Discharge message about this encounter to SHD.",
  "comments" : "This Test Case provides an example of an ED visit where the patient's demographic information is unavailable at registration, admit/encounter reason is captured as a coded value using an ICD-10 CM code, two working diagnoses and a final diagnosis are captured using ICD-10 CM codes, and the patient dies. The dates and times in this test case illustrate the sequence of clinical and messaging events. Since the exact dates and times are not reproducible when modeling the test case with a Health IT Module, only date and time format will be validated within tester submitted test data. ICD-10 CM diagnosis codes are acceptable with or without decimals.",
  "preCondition" : "A08-Update message is sent before the A03-Discharge message.",
  "postCondition" : "No PostCondition",
  "testObjectives" : "This test case examines a Health IT Module's ability to create ADT^A03 Discharge message within PHIN Messaging Guide's conformance requirements for emergency department (ED) data.",
  "evaluationCriteria" : "No evaluation criteria",
  "notes" : "<p class=\"MsoNormal\">HIT developers must demonstrate that their system supports ICD-9CM, ICD-10CM, and SNOMED CT value sets in order to be conformant to the PHIN Syndromic Surveillance Messaging Guide, Rel2.0, April 2015. If an HIT developer identifies Emergency Department as the only health care setting applicable to their system, the Tester must execute the certification testing for this Test Step by having the system create messages (1) using the ICD-10CM codes provided in the test data for PV2-3 and DG1-3 in a test message, (2) using clinically appropriate (equivalent to the ICD-10CM codes provided in the test data) and valid ICD-9CM codes provided by the vendor for PV2-3 and DG1-3 in a test message, and (3) using clinically appropriate (equivalent to the ICD-10CM codes provided in the test data) and valid SNOMED CT codes provided by the vendor for PV2-3 and DG1-3 in a test message. The Tester must perform visual inspection of the test messages created by the system in order to determine whether PV2-3 and DG1-3 fields are populated with appropriate and valid ICD-9CM and SNOMED CT codes. </p><p class=\"MsoNormal\">ICD-10 CM codes are used for coding the admit/encounter reason and final diagnoses. If the vendor uses different but equivalent ICD-10CM codes than the ones provided, the Tester may ignore errors generated by the Test Tool related to incorrect code when the ICD-10 CM codes used in the message are determined to be valid codes. </p><p class=\"MsoNormal\">ICD-10CM and ICD-9CM diagnosis codes are acceptable with or without decimals. </p><p class=\"MsoNormal\">This Test Step does not prescribe the method used by the Health IT Module to change a working diagnosis to a final diagnosis. The Test Step only validates a specific ADT message type.</p><p class=\"MsoNormal\"><span style=\"font-size: 10pt;\">Visit Number ID (PV1-19.1) must be populated with the same value for all messages included in this Test Case to reflect the requirement in real-world installations. Test Tool does not automatically test for this requirement, so Testers must manually inspect the messages to verify that PV1-19.1 is the same for all Test Step messages for a given Test Case.</span></p>"
}