{
  "teststorydesc" : "The patient`s vital signs gradually return to normal. At 2 PM, the patient`s laboratory and radiology tests results are provided to the attending physician. The tests indicate that the infant has influenza, and does not have pneumonia. The patient`s mother is provided with treatment information and prescriptions for her infant son. The working diagnoses (ICD-9 CM 487.1 and 380.53) are resolved/inactivated, and at 5 PM the patient is discharged home with final diagnoses of influenza and stenosis of external ear canal due to inflammation. Big City Children's Urgent Care is an outpatient facility operated by Children's Hospital of Big City that routinely sends electronic syndromic surveillance data to the Big City Health Department (BCHD) in accordance with a city regulation. At 6:00 PM on February 20, 2010, the facility`s electronic health record module for syndromic surveillance data assembles and transmits a Discharge ADT message about this patient encounter to BCHD.",
  "comments" : "This Test Scenario provides an example of clinical encounter that could take place in either an urgent care or emergency clinical setting. It is therefore applicable to EHR technology used in some ambulatory settings. Dates and times are provided in this test scenario to illustrate the sequence of clinical and messaging events. Since the exact dates and times are not reproducible when modeling the test scenario with EHR technology, only date and time format will be validated within tester submitted test data.",
  "preCondition" : "A04-Registration message is sent before A03-Discharge message.",
  "postCondition" : "No PostCondition",
  "testObjectives" : "Output an ADT^A03 discharge message in HL7 2.5.1 containing the syndromic surveillance data for the patient encounter.",
  "evaluationCriteria" : "No evaluation criteria",
  "notes" : "HIT developers must demonstrate that their system supports ICD-9CM, ICD-10CM, and SNOMED CT value sets in order to be conformant to the PHIN Syndromic Surveillance Messaging Guide, Rel2.0, April 2015. If an HIT developer identifies Urgent Care as the only health care setting applicable to their system, the Tester must execute the certification testing for this Test Step by having the system create messages (1) using the ICD-9CM codes provided in the test data for DG1-3 in a test message, (2) using clinically appropriate (equivalent to the ICD-9CM codes provided in the test data) and valid ICD-10CM codes provided by the vendor for DG1-3 in a test message, and (3) using clinically appropriate (equivalent to the ICD-9CM codes provided in the test data) and valid SNOMED CT codes provided by the vendor for DG1-3 in a test message. The Tester must perform visual inspection of the test messages created by the system in order to determine whether DG1-3 fields are populated with appropriate and valid ICD-10CM and SNOMED CT codes.  <div><br></div><div>ICD-9CM codes are provided in the test data for coding the working diagnoses. If the vendor uses different but equivalent ICD-9CM codes than the ones provided, the Tester may ignore errors generated by the Test Tool related to incorrect code when the ICD-9CM code used in the message is determined to be a valid code.  </div><div><br></div><div>ICD-9CM and ICD-10CM diagnosis codes are acceptable with or without decimals. <div><br></div><div>Although the other units of measure for patient age are acceptable in general (and the Context-free validation accepts any of the valid units of measure for age), this Scenario specifies that \"mo\" for months be used in this message for the Context-based validation.  <div><br></div><div>Visit Number ID (PV1-19.1) must be populated with the same value for all messages included in this Test Case to reflect the requirement in real-world installations. Test Tool does not automatically test for this requirement, so Testers must manually inspect the messages to verify that PV1-19.1 is the same for all Test Step messages for a given Test Case. </div></div></div>"
}