{
  "teststorydesc" : "While the patient is prepared for transport within the hospital for HBOT, the clinical staffers complete an admission record. The admit reason is recorded as, \"Accidental exposure to carbon monoxide,\" (SNOMED CT code 242383002). Southern Midwest Medical Center reports syndromic surveillance data to the city health department (CHD). At 8:35 AM on February 1, 2010, the hospitals electronic health record module for syndromic surveillance data assembles and transmits an Admission message about this encounter to SHD.",
  "comments" : "This Test Case provides an example of an ED visit for which the patient's chief complaint is captured as free-text, working diagnosis and final diagnosis are captured with SNOMED CT codes, the patient is discharged from the ED and admitted for inpatient care, and the Admit/Encounter Reason is captured with a SNOMED CT code. Dates and times are provided in this test case to illustrate the sequence of clinical and messaging events. Since the exact dates and times are not reproducible when modeling the Test Case with a Health IT Module, only date and time format will be validated within tester submitted test data.",
  "preCondition" : "A03-Discharge message is sent before A01-Admission message.",
  "postCondition" : "No PostCondition",
  "testObjectives" : "This test case examines a Health IT Module's ability to create ADT^A01 Admission message within the PHIN Messaging Guide's conformance requirements for syndromic surveillance.",
  "evaluationCriteria" : "No evaluation criteria",
  "notes" : "PV1-2 may be populated with either \"E\" or \"I\". <div><br></div><div>HIT developers must demonstrate that their system supports ICD-9CM, ICD-10CM, and SNOMED CT value sets in order to be conformant to the PHIN Syndromic Surveillance Messaging Guide, Rel2.0, April 2015. If an HIT developer identifies Emergency Department as the only health care setting applicable to their system, the Tester must execute the certification testing for this Test Step by having the system create messages (1) using the SNOMED CT codes provided in the test data for PV2-3 in a test message, (2) using clinically appropriate (equivalent to the SNOMED CT codes provided in the test data) and valid ICD-9CM codes provided by the vendor for PV2-3 in a test message, and (3) using clinically appropriate (equivalent to the SNOMED CT codes provided in the test data) and valid ICD-10CM codes provided by the vendor for PV2-3 in a test message. The Tester must perform visual inspection of the test messages created by the system in order to determine whether PV2-3 fields are populated with appropriate and valid ICD-9CM and ICD-10CM codes. </div><div><br></div><div>A SNOMED CT code is used for coding the admit/encounter reason. The Tool is designed to accept the following SNOMED CT codes without generating an error related to the admit/encounter reason:</div><div><span style=\"font-size: 10pt;\">242383002 - Accidental exposure to carbon monoxide (used in Test Story)</span></div><span style=\"font-size: 10pt;\">420057003 - Accidental poisoning by carbon monoxide</span><br><div>95875007 - Exposure to carbon monoxide (event) </div><div><br></div><div>Any one of these codes may be used to populate PV2-3.1 in the test message without triggering an error notification in the Tool. If the vendor uses a different but equivalent SNOMED CT code than the ones listed, the Tester may ignore errors generated by the Test Tool related to incorrect code when the SNOMED CT code used in the message is determined to be a valid code.</div><div><br></div><div>ICD-9CM and ICD-10CM diagnosis codes are acceptable with or without decimals. </div><div><br></div><div>The OBX segment in the A01 message provides the originating visit type information through Facility/Visit Type. The admit described in the ED_Visit_Admit Test Scenario originated in the emergency department; therefore, \"Emergency Care\" is messaged in the OBX.5 element in the A01 message. </div><div><br></div><div>Visit Number ID (PV1-19.1) for the ADT^A01 message in this Test Case may be populated with the same value as in the ADT^A04, ADT^A08, and ADT^A03 messages; however, as the way an actual installation works will determine whether an A01 message has the same or a different Visit Number ID in PV1-19.1 for a patient admitted from the ED, the PV1-19.1 for the ADT^A01 message is allowed to be populated with a different value than the value in the ADT^A04, ADT^A08, and ADT^A03 messages for this Test Case. Test Tool does not automatically test for this requirement, so Testers must manually inspect the message to verify whether the value of PV1-19.1 is the same as or different from the value in the other Test Step messages for this Test Case. </div>"
}