{
  "teststorydesc" : "<p>A mother brings her 6 month old male infant to Big City Children's Urgent Care on February 20, 2010 at 8:30 am. A clerical assistant registers the patient. She records the patient`s name, date of birth, race, ethnicity, residence, insurance information, and health history. The clerical assistant also records the patient's chief complaint in free-text is, \"Fever, cough.\" At 8:35AM a nurse sees the patient and performs a vital sign assessment, noting that the child currently has a temperature of 101.2 with a productive cough along with upper respiratory congestion. At 9:00 AM the physician orders a treatment and diagnostic tests, and assigns the patient with a working diagnosis of influenza with other respiratory manifestations (ICD-9 CM diagnosis code of 487.1) within the patient`s electronic medical record. Big City Children's Urgent Care is an outpatient facility operated by Children's Hospital of Big City that routinely sends electronic syndromic surveillance data to the Big City Health Department (BCHD) in accordance with a city regulation. At 10:00 AM on February 20, 2010, the facility's electronic health record module for syndromic surveillance data assembles and transmits a Registration ADT message about this patient encounter.</p>\r\n",
  "comments" : "<p>This Test Scenario provides an example of clinical encounter that could take place in either an urgent care or emergency clinical setting. It is therefore applicable to EHR technology used in some ambulatory settings. Dates and times are provided in this test scenario to illustrate the sequence of clinical and messaging events. Since the exact dates and times are not reproducible when modeling the test scenario with EHR technology, only date and time format will be validated within tester submitted test data.</p>\r\n",
  "preCondition" : "<p>No PreCondition</p>\r\n",
  "postCondition" : "<p>No PostCondition</p>\r\n",
  "testObjectives" : "<p>Output an ADT A04 registration message in HL7 containing syndromic surveillance data for the patient encounter</p>\r\n",
  "evaluationCriteria" : "<p>No evaluation criteria</p>",
  "notes" : "<p>Although the other units of measure for patient age are acceptable in general (and the Context-free validation accepts any of the valid units of measure for age), Scenario #1 specifies that \"mo\" for months be used in this message for the Context-based validation. ICD 9 CM diagnosis codes are acceptable with or without decimals.</p>\r\n"
}