{
  "teststorydesc" : "Physical examination, CT scan of the head and neck reveal a fracture to the base of the patient's skull and massive intracranial bleeding. While the patient's examination and diagnostic tests are proceeding an emergency room tech uncovers the patient's driver's license among the belongings brought to the ED by the paramedics. At 5:20 PM the patient's medical record is updated with working diagnosis ICD-10 codes S02.112A (Type III occipital condyle fracture, initial encounter for closed fracture) and S06.9X3A (Unspecified intracranial injury with loss of consciousness of 1 hour to 5 hours 59 minutes, initial encounter). Also at this time, the patient's license is used to update the medical record with name and date of birth. Western Regional Medical Center reports syndromic surveillance data to the state health department (SHD). At 5:30 PM on July 17, 2012 the hospital's electronic health record module for syndromic surveillance data assembles and transmits an ADT 08 Update message about this encounter to SHD.",
  "comments" : "This Test Case provides an example of an ED visit where the patient's demographic information is unavailable at registration, admit/encounter reason is captured as a coded value using an ICD-10 CM code, two working diagnoses and a final diagnosis are captured using ICD-10 CM codes, and the patient dies. The dates and times in this test case illustrate the sequence of clinical and messaging events. Since the exact dates and times are not reproducible when modeling the test case with a Health IT Module, only date and time format will be validated within tester submitted test data. ICD-10 CM diagnosis codes are acceptable with or without decimals.",
  "preCondition" : "A04-Registration message is sent before the A08-Update message.",
  "postCondition" : "No PostCondition",
  "testObjectives" : "This test case examines a Health IT Module's ability to create ADT^A08 Update message within PHIN Messaging Guide's conformance requirements",
  "evaluationCriteria" : "No evaluation criteria",
  "notes" : "An ICD-10 CM code is used for coding the working diagnosis. The Tester may ignore errors generated by the Test Tool related to incorrect code when the ICD-10 code used in the message is determined to be a valid code. \r\n<div><br></div><div>Visit Number ID (PV1-19.1) must be populated with the same value for all messages included in this Test Case to reflect the requirement in real-world installations. Test Tool does not automatically test for this requirement, so Testers must manually inspect the messages to verify that PV1-19.1 is the same for all Test Step messages for a given Test Case.</div>"
}